// MORE tASKS IN LESSON 3
//
// Ваша функція має приймати одне натуральне число, після чого вивести:
//
//     "Fizz", якщо це число ділиться на 3;
// "Buzz", якщо це число ділиться на 5;
// “FizzBuzz”, якщо виконані обидві попередні умови;
// саме це число в інших випадках
//
// EXAMPLE:
//     Input: 15
// Output: FizzBuzz
//
// Input: 10
// Output: Buzz
//


// function fizz (num){
//
//     if (num % 3 === 0 && num % 5 === 0) {
//         return 'FizzBuzz';
//     }
//     if (num % 3 === 0) {
//         return 'Fizz'
//     }
//     if (num % 5 === 0) {
//         return 'Buzz'
//     }
//     return num
// }
//
// console.log(fizz(5));



// ----------------
//
//
//     У цьому завдання вам належить побудувати драбинку з чисел.
//     Програма приймає на вхід ціле позитивне число n (n<=15) - кількість рівнів, ваше завдання вивести n рівнів,
//     у кожному з яких стоять числа від 1 до рівня.
//
//     Вивести можна або вигляді кожного нового рядка, або списку.
//
//     EXAMPLE:
// Input: 2
//
// Output:
//     [
//         [1],
//         [1,2]
//     ]
//
// Input: 4
//
// Output:
//     [
//         [1],
//         [1,2],
//         [1,2,3],
//         [1,2,3,4]
//     ]

// const drabunka = n =>{
//     if(n>16){
//         return 'Введи число до 15'
//     }
//     for (let i = 1; i <= n; i++) {
//         let arr=[]
//         for (let j = 1; j <= i; j++) {
//             arr.push(j);
//         }
//         console.log(arr);
//     }
// }
// drabunka(14)


// ---------------------------
//
//     Напишіть функцію для побудови горизонтальних стовпчастих діаграм за допомогою символу зірочки.
//     Вводити потрібно масив з цілими данними
//
// EXAMPLE:
//     Input: [3,7,1,10,8]
//
// Sample Output:
//     ***
// *******
// *
// **********
// ********

const zirochka = (arr)=>{

    for (let i = 0; i <= arr.length; i++) {
        let secondArr = [];
        for (let j = 0; j < arr[i]; j++) {
            secondArr.push('*');
        }
        console.log(secondArr.join(''))
    }
}
zirochka([3,7,1,10,8])